openFOAM/karmanVortexStreet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (0 0 0.02)
    (0.4 0 0)
    (0.4 0 0.02)
    (0.6 0 0)
    (0.6 0 0.02)
    (1 0 0)
    (1 0 0.02)
    (5 0 0)
    (5 0 0.02)

    (0 0.4 0)
    (0 0.4 0.02)
    (0.4 0.4 0)
    (0.4 0.4 0.02)
    (0.6 0.4 0)
    (0.6 0.4 0.02)
    (1 0.4 0)
    (1 0.4 0.02)
    (5 0.4 0)
    (5 0.4 0.02)

    (0 0.6 0)
    (0 0.6 0.02)
    (0.4 0.6 0)
    (0.4 0.6 0.02)
    (0.6 0.6 0)
    (0.6 0.6 0.02)
    (1 0.6 0)
    (1 0.6 0.02)
    (5 0.6 0)
    (5 0.6 0.02)

    (0 1 0)
    (0 1 0.02)
    (0.4 1 0)
    (0.4 1 0.02)
    (0.6 1 0)
    (0.6 1 0.02)
    (1 1 0)
    (1 1 0.02)
    (5 1 0)
    (5 1 0.02)
);

blocks
(
    hex (0 2 12 10 1 3 13 11) (20 20 1) simpleGrading (1 1 1)
    hex (2 4 14 12 3 5 15 13) (10 20 1) simpleGrading (1 1 1)
    hex (4 6 16 14 5 7 17 15) (20 20 1) simpleGrading (1 1 1)
    hex (6 8 18 16 7 9 19 17) (200 20 1) simpleGrading (1 1 1)

    hex (10 12 22 20 11 13 23 21) (20 10 1) simpleGrading (1 1 1)
    hex (14 16 26 24 15 17 27 25) (20 10 1) simpleGrading (1 1 1)
    hex (16 18 28 26 17 19 29 27) (200 10 1) simpleGrading (1 1 1)

    hex (20 22 32 30 21 23 33 31) (20 20 1) simpleGrading (1 1 1)
    hex (22 24 34 32 23 25 35 33) (10 20 1) simpleGrading (1 1 1)
    hex (24 26 36 34 25 27 37 35) (20 20 1) simpleGrading (1 1 1)
    hex (26 28 38 36 27 29 39 37) (200 20 1) simpleGrading (1 1 1)
);

r #calc"Foam::sqrt(2.0)*0.1";
posCoord #calc"0.5+$r";
negCoord #calc"0.5-$r";
edges
(
    arc 12 14 (0.5 $negCoord 0)
    arc 13 15 (0.5 $negCoord 0.02)

    arc 14 24 ($posCoord 0.5 0)
    arc 15 25 ($posCoord 0.5 0.02)

    arc 24 22 (0.5 $posCoord 0)
    arc 25 23 (0.5 $posCoord 0.02)
    
    arc 22 12 ($negCoord 0.5 0)
    arc 23 13 ($negCoord 0.5 0.02)
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (10 11 21 20)
            (20 21 31 30)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (8 9 19 18)
            (18 19 29 28)
            (28 29 39 38)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 3 2)
            (2 3 5 4)
            (4 5 7 6)
            (6 7 9 8)

            (30 31 33 32)
            (32 33 35 34)
            (34 35 37 36)
            (36 37 39 38)

            // obstacle
            (12 13 15 14)
            (14 15 25 24)
            (24 25 23 22)
            (22 23 13 12)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 12 10)
            (1 3 13 11)
            (2 4 14 12)
            (3 5 15 13)
            (4 6 16 14)
            (5 7 17 15)
            (6 8 18 16)
            (7 9 19 17)

            (10 12 22 20)
            (11 13 23 21)
            (14 16 26 24)
            (15 17 27 25)
            (16 18 28 26)
            (17 19 29 27)

            (20 22 32 30)
            (21 23 33 31)
            (22 24 34 32)
            (23 25 35 33)
            (24 26 36 34)
            (25 27 37 35)
            (26 28 38 36)
            (27 29 39 37)
        );
    }
);


// ************************************************************************* //
