openFOAM/karmanVortexStreet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // parabolic inflow
    leftWall
    {
        type            codedFixedValue;
        value           uniform (0 0 0);

        name            parabolicInflow;
        code
        #{
            const scalar uMax = 1.0;
            const scalar yMin = 0.0;
            const scalar yMax = 1.0;
            const scalar halfH = 0.5 * (yMax - yMin); // Half-height of the channel
            const scalar halfY = 0.5 * (yMax + yMin); // Half-y-coordinate of the channel
            
            const vectorField& faceCenters = patch().Cf();
            vectorField& values = *this;

            forAll(faceCenters, i)
            {
                const scalar y = faceCenters[i][1];
                values[i] = vector(uMax*(1 - (y-halfY)*(y-halfY)/(halfH*halfH)), 0, 0);
            }
        #};
    }

    rightWall
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
